---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleMarkerType
source: html/54386202-c4ca-68af-601e-9bb6bb098a09.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleMarkerType

Marker types for Markers and Text settings of analysis display style.

## Syntax (C#)
```csharp
public enum AnalysisDisplayStyleMarkerType
```